Podkova/src/InformationRegisters/ПриглашенияКОбменуЭлектроннымиДокументами/ПриглашенияКОбменуЭлектроннымиДокументами.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПриглашенияКОбменуЭлектроннымиДокументами</name>
  <resources>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыПриглашений</types>
    </type>
  </resources>
  <resources>
    <name>ТекстПриглашения</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>Email</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ОператорЭДО</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ДатаИзмененияСтатуса</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеОшибки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>DefinedType.КонтрагентБЭД</types>
    </type>
  </attributes>
  <attributes>
    <name>ИНН</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КПП</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Наименование</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ознакомиться</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсходныйКонтрагент</name>
    <comment>Контрагент на которого изначально отправлялось приглашение. Заполняется только при различающемся контрагенте принявшем приглашение</comment>
    <type>
      <types>DefinedType.КонтрагентБЭД</types>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаОтказа</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>EmailОрганизации</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>ИдентификаторОрганизации</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>70</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ИдентификаторКонтрагента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>70</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Podkova/src/InformationRegisters/СостоянияКонтрагентовБЭД/СостоянияКонтрагентовБЭД.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СостоянияКонтрагентовБЭД</name>
  <resources>
    <name>Состояние</name>
    <type>
      <types>EnumRef.СостоянияКонтрагентаБЭД</types>
    </type>
  </resources>
  <attributes>
    <name>ИНН</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КПП</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>DefinedType.КонтрагентБЭД</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Podkova/src/Enums/СтатусыПриглашений/СтатусыПриглашений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыПриглашений</name>
  <enumValues>
    <name>ТребуетсяОтправить</name>
  </enumValues>
  <enumValues>
    <name>УдалитьТребуетсяОтсоединить</name>
  </enumValues>
  <enumValues>
    <name>Принято</name>
  </enumValues>
  <enumValues>
    <name>Отклонено</name>
  </enumValues>
  <enumValues>
    <name>ОжидаемСогласия</name>
  </enumValues>
  <enumValues>
    <name>ТребуетсяСогласие</name>
  </enumValues>
  <enumValues>
    <name>Ошибка</name>
  </enumValues>
</mdclass:Enum>

Podkova/src/Enums/СостоянияКонтрагентаБЭД/СостоянияКонтрагентаБЭД.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СостоянияКонтрагентаБЭД</name>
  <enumValues>
    <name>Подключен</name>
  </enumValues>
  <enumValues>
    <name>НеПодключен</name>
  </enumValues>
  <enumValues>
    <name>НастроенЭДО</name>
  </enumValues>
</mdclass:Enum>

Podkova/src/InformationRegisters/ПриглашенияКОбменуЭлектроннымиДокументами/RecordSetModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПриЗаписи(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого Запись Из ЭтотОбъект Цикл
		
		Если Запись.Статус = Перечисления.СтатусыПриглашений.Отклонено Тогда
			ЗаписьСостоянияКонтрагента = РегистрыСведений.СостоянияКонтрагентовБЭД.СоздатьМенеджерЗаписи();
			ЗаписьСостоянияКонтрагента.Контрагент = Запись.Контрагент;
			
			ЗаписьСостоянияКонтрагента.Прочитать();
			
			Если ЗаписьСостоянияКонтрагента.Выбран() Тогда 
				ЗаписьСостоянияКонтрагента.Состояние = Перечисления.СостоянияКонтрагентаБЭД.Подключен;
				ЗаписьСостоянияКонтрагента.Записать();
			КонецЕсли;
			
		КонецЕсли;
	
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Иначе
	ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
